---
kind: type
id: T:Autodesk.Revit.DB.Visual.WaveDistributionType
source: html/36633e2e-86a9-a445-8beb-a59c669af475.htm
---
# Autodesk.Revit.DB.Visual.WaveDistributionType

The enumerated type representing the permitted values for the asset property "WaveDistribution" from the "Wave" schema.

## Syntax (C#)
```csharp
public enum WaveDistributionType
```